[
    {
        "date": "2026-01-28",
        "date_display": "January 28, 2026",
        "speaker": "GP Uncle",
        "members": "Evan, Christy, Jonathan, Krupa, Elsa, Joel, Jeyraj",
        "portion": "Galatians 5:1–12",
        "title": "Freedom in Christ vs. Bondage of the Law",
        "summary": "**V1: Freedom in Christ**\nPaul declares that Christ has set us free for true freedom. Believers are warned not to submit again to a \"yoke of slavery,\" which represents spiritual bondage.\n\n**Meaning of the Yoke (Bondage)**\nThe yoke symbolizes enforced religious obligation—trying to please God through human effort and works. The opposite of this bondage is freedom, liberty, and life in Christ.\n\n**Historical Context of the Galatian Church**\nThe Galatian church consisted of both Gentiles and Jews. Paul preached the Gospel of grace to the Gentiles without imposing the Law of Moses. Later, Jewish teachers came and insisted that obeying Mosaic Law was necessary for salvation.\n\n**Paul’s Strong Warning (V12)**\nPaul speaks strongly against those who trouble believers with legalism, emphasizing how dangerous false teaching is to spiritual freedom.\n\n**Foolish Galatians**\nAfter being troubled by false teachers, Paul rebukes them as \"foolish\" for turning back to works. He reminds them that nothing good comes from human effort alone.\n\n**Key Truth**\nWe cannot please God through our acts or obedience to the Law. Our righteousness comes through faith in Christ alone.\n\n**Supporting Scripture**\nGalatians 2:20 reminds us that it is no longer we who live, but Christ who lives in us."
    },
    {
        "date": "2025-12-10",
        "date_display": "December 10, 2025",
        "speaker": "Thomas Antony Uncle",
        "members": "Evan, Chris, Jonathan, Christy, Johan, Elsa, Jeyraj, Joel",
        "portion": "Galatians 4:21–31",
        "title": "Children of the Promise vs. The Flesh",
        "summary": "**V21: The Challenge of the Law**\nPaul challenges those who cling to the Law of Moses to actually listen to what the scripture says. Even the Law itself reveals that legalism is not the path to God.\n\n**Historical Context**\nAbraham and Sarah tried to fulfill God’s promise through human effort, resulting in Ishmael. This represents reliance on the flesh rather than trusting God's promise.\n\n**V24–25: Two Covenants**\nHagar represents the covenant of Law that leads to bondage, while Sarah represents the covenant of promise that leads to freedom.\n\n**V28: Children of the Promise**\nBelievers are born of the Spirit, not through rule-keeping. Sonship is a spiritual birthright, not a reward for obedience.\n\n**Key Takeaways**\nWe must wait for God to fulfill His promises and live in the freedom of the Spirit rather than the burden of works."
    },
    {
        "date": "2025-12-03",
        "date_display": "December 3, 2025",
        "speaker": "Saji Uncle",
        "members": "Evan, Christy, Noyal, Nevin, Joel, Varghese Uncle",
        "portion": "John 5:1–15",
        "title": "Not Being a Witness of Jesus in Campus Is a Sin",
        "summary": "**Healing at Bethesda**\nJesus healed an invalid of 38 years who focused on his problems rather than faith. Jesus intervened and restored him instantly.\n\n**Warning and Responsibility**\nJesus warned the healed man to stop sinning. The man later testified about Jesus despite opposition.\n\n**Spiritual Application**\nGod chooses individuals from broken places. Silence about Christ is identified as sin.\n\n**Call to Action**\nBelievers are called to boldly witness for Christ, especially in their campus."
    },
    {
        "date": "2025-11-26",
        "date_display": "November 26, 2025",
        "speaker": "Bibin",
        "members": "Evan, Jonathan, Chris, Christy, Bibin, Jeyraj",
        "portion": "John 17:1–5",
        "title": "The Prayer of Jesus",
        "summary": "**Dependence on God**\nJesus looked to the Father in prayer, teaching us to rely on God first.\n\n**Trusting God’s Timing**\nJesus accepted that His hour had come, reminding us to surrender to God’s timing.\n\n**Living for God’s Glory**\nOur lives should glorify God, not ourselves.\n\n**Eternal Life**\nEternal life is knowing God personally.\n\n**Faithfulness**\nJesus completed His mission; believers are called to faithfulness."
    },
    {
        "date": "2025-11-19",
        "date_display": "November 19, 2025",
        "speaker": "Thomas Antony Uncle",
        "members": "Evan, Jonathan, Chris, Noyal, Joel, Jeyraj, Jane",
        "portion": "Galatians 4:17–20",
        "title": "The Goal – Christ Formed in Us",
        "summary": "**False Zeal vs. True Zeal**\nFalse teachers seek personal control, while true zeal aims for spiritual growth.\n\n**Christ Formed in Us**\nSanctification is the lifelong process of becoming like Christ.\n\n**Growth Process**\nMeditation on Scripture and honest self-reflection enable maturity.\n\n**Care for Others**\nSpiritual maturity includes a burden for others to grow in Christ."
    },
    {
        "date": "2025-10-22",
        "date_display": "October 22, 2025",
        "speaker": "Bipin Chettan",
        "members": "Christy, Evan, Jonathan, Elsa, Krupa, Joel, Jeyraj",
        "portion": "Luke 2:42–52",
        "title": "Four Growths of Jesus",
        "summary": "**Spiritual Growth**\nUnderstanding identity as a child of God.\n\n**Mental Growth**\nGrowth in wisdom and discernment.\n\n**Physical Growth**\nHealthy development of the body.\n\n**Social Growth**\nGrowing in favor and relationships.\n\n**Balanced Life**\nTrue maturity requires growth in all four areas."
    },
    {
        "date": "2026-02-04",
        "date_display": "February 04, 2026",
        "speaker": "Thomas Antony uncle",
        "portion": "Galatians 5:1-12",
        "title": "Freedom Through Christ",
        "summary": "[{\"insert\":\"• Christ gives true freedom — “\"},{\"insert\":\"For freedom Christ has set us free.”\",\"attributes\":{\"italic\":true}},{\"insert\":\"\\n• This freedom means being released from the power of sin and from trying to earn salvation through human effort or religious laws.\\n• The main problem in Galatia was confusion caused by false teachings.\\n• Some teachers insisted that Christians must follow the Law of Moses, especially circumcision, to be saved.\\n• Righteousness comes through Christ, not through the Law.\\n• Galatians 5:4 teaches that trying to become righteous by obeying the law means moving away from grace.\\n• Salvation is through faith in Christ, not legal obedience.\\n• Paul warns in verse 2 that believing circumcision is required for salvation makes Christ’s sacrifice seem unnecessary.\\n• The teaching that good works alone earn heaven is false.\\n• Good works are the result of salvation, not the cause of it.\\n• Christians should not misuse freedom by returning to sinful patterns.\\n• Believers are called to live carefully and faithfully in the freedom Christ provides.\\n\"}]",
        "members": "Jeyaraj , Chris , Christy, Johan , Joel"
    }
]